---
kind: other
id: Methods.T:Autodesk.Revit.DB.DefaultDivideSettings
source: html/9f5ff29f-b845-f098-0613-b38329a37de0.htm
---
# DefaultDivideSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.